---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketchError
source: html/b2054463-0a98-2c28-3bec-95dba5c75fa6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarEmptySketchError Property

Rebar Sketch is empty. Can't create Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarEmptySketchError { get; }
```